Autodesk.Revit.DB.Structure.FabricSheet.SetUnobscuredInView(Autodesk.Revit.DB.View,System.Boolean)
Sets this fabric sheet to be shown unobscured in a view.
view:
The view element
unobscured:
True if fabric sheet is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This fabric sheet doesn't have valid visibility data.
Since:
2021

Autodesk.Revit.DB.Structure.FabricSheet.IsUnobscuredInView(Autodesk.Revit.DB.View)
Checks if this fabric sheet is shown unobscured in a view.
view:
The view element
Returns:
True if fabric sheet is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This fabric sheet doesn't have valid visibility data.
Since:
2021

Autodesk.Revit.DB.Structure.FabricSheet.SetSolidInView(Autodesk.Revit.DB.View3D,System.Boolean)
Sets this fabric sheet to be shown solidly in a 3D view.
view:
The 3D view element
solid:
True if fabric sheet is shown solidly, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This fabric sheet doesn't have valid visibility data.
Since:
2021

Autodesk.Revit.DB.Structure.FabricSheet.IsSolidInView(Autodesk.Revit.DB.View3D)
Checks if this fabric sheet is shown solidly in a 3D view.
view:
The 3D view element
Returns:
True if fabric sheet is shown solidly, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This fabric sheet doesn't have valid visibility data.
Since:
2021